Revit 2026 API

# XYZMultiply Method

---

Multiplies this vector by the specified value and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Multiply(
	double value
)
```
```vb
Public Function Multiply (
	value As Double
) As XYZ
```
```cpp
public:
XYZ^ Multiply(
	double value
)
```
```fsharp
member Multiply :
        value : float -> XYZ
```

#### Parameters

value Double
    The value to multiply with this vector.

#### Return Value

XYZThe multiplied vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |

The multiplied vector is obtained by multiplying each coordinate of this vector by the specified value.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace